Revit 2026 API

# IFCCategoryTemplateGetOrCreateInSessionTemplate Method

---

Gets the in-session non-serializable template or create new.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IFCCategoryTemplate GetOrCreateInSessionTemplate(
	Document document
)
```
```vb
Public Shared Function GetOrCreateInSessionTemplate (
	document As Document
) As IFCCategoryTemplate
```
```cpp
public:
static IFCCategoryTemplate^ GetOrCreateInSessionTemplate(
	Document^ document
)
```
```fsharp
static member GetOrCreateInSessionTemplate :
        document : Document -> IFCCategoryTemplate
```

#### Parameters

document Document
     The document to find the in-session mapping template.

#### Return Value

IFCCategoryTemplate The mapping template, or  if failed to create.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCCategoryTemplate Class

Autodesk.Revit.DB Namespace